---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IndexLine Properties
IndexLine Class See Also Send Feedback
---

The IndexLine type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Index0 | The index of the line segment's first vertex. |
|  | Index1 | The index of the line segment's second vertex. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from IndexPrimitive.) |

# See Also

IndexLine Class

Autodesk.Revit.DB.DirectContext3D Namespace